9/data/attachments/559643a4bf4401ff.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_c5b21c29-f198-4567-aa82-797cd4783e46</nif:username>
            <nif:friendToBeAdded>Todd_affect_Friend_87738_7</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>